refactor to make idempotent using vault tasks
Signed-off-by: Jakub Sokołowski <jakub@status.im>
